#pragma once

// BlazingSails (Dumped by Hinnie) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass Character_AnimBP.Character_AnimBP_C
// 0xB367 (0xB6C7 - 0x0360)
class UCharacter_AnimBP_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0360(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_D9E9A0804062B964B460FCAE828CDEE7;      // 0x0368(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AD9D9D8A43C5795C46159D8CBC255D96;// 0x03A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F22DBF8948C812E52BC2E7B9AA7E7459;// 0x03F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9D0E611F4A746845ECA8C59556C9AEAE;// 0x0438(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_84547E3A49887BF52570869F0B54719C;// 0x0480(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F16A02124984E51E6CE225ACCD2EF3C4;// 0x04C8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_CE19922E499E74FD1F3A619207ACA131;// 0x0568(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_37AEFA9F4D200D9B3704C4B58BC320BA;// 0x05A8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_01DCAD6C43E9B89D3BEAA49667C19409;// 0x0648(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FABC2D2F4B1510CEA2261881AAE6C133;// 0x06E8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9911A32941DE25BED350A48541D46C69;// 0x0788(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_33F0845C4B3074E15258EDB28710DD8C;// 0x0828(0x00A0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_A68CC0984EACBACDA8FB0295A18F5377;// 0x08C8(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_F78F9BBA471591BB91C146B95961D039;// 0x09A8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_035EDAAB4213C04F04F6A08539147B88;// 0x0A78(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7584A01641CA713E328209A814F74131;// 0x0B18(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7D5BDD8A400E9D1CDDCE79A4082399AB;// 0x0BB8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_62E5AC634D7202EB4B4183A15E873001;// 0x0C88(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_0E2734044A0C8C002EBD8DBC57604A29;// 0x0D28(0x00D8)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_E50E6B65476FA671E2EA58AAD047233B;// 0x0E00(0x0070)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_EFDE99294D57F64FEEA8E894CCE4F85D;// 0x0E70(0x0040)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_CBE2FBDA4EDF2B5CE9C3D2ADBEB4D495;// 0x0EB0(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_87ADA5ED409E7EA0690C75BAC289527E;// 0x0F80(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_927E20B84362447CEA4E68A2C8584219;// 0x1020(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A463CC3740FE6CF3AE501BB4F0BEEC6C;// 0x10F0(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4D4691ED4C21C93F6F1318851D7C326A;// 0x1190(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D202D551412A97668988A6931C817A92;// 0x1260(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_17E96990446D3048B42DA8B8DC073001;// 0x1300(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_693749F14B323482B3FEBA8BEBFFC51E;// 0x13D0(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B6BB48CA4028B59562031E954DA20F3B;// 0x1470(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D23FEFED4337B2227271EEA76FEE7BD7;// 0x1540(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_3B96F5CC4BF24DF37B29B294631FF87F;// 0x15E0(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_60094DC046752D4C79C650B475F54245;// 0x16B0(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_1DE9B5B74DD76430C07700A069F43C1D;// 0x1750(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_922B771847535DE15A29C097169586A2;// 0x1820(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2F1908CF4444A60CE1E48883A0C3BC14;// 0x18F0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A88A00204375A18BF1B612A02D86FAE8;// 0x1990(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E603D123466348438CE14F9B9210B772;// 0x1A30(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E472686443EA8A45C5ACBAACC405E2BD;// 0x1B00(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D790F19D4AF3B5FAD32549B1BF7EA23A;// 0x1BA0(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_26DF7FEE4265B80FC274FEAF74D07CCD;// 0x1C70(0x0128)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C7745A1548C4DF545C8A87A24FB1BE25;// 0x1D98(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7D011B8A4482C8BC491D0D85DEFCB302;// 0x1E38(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EBE886CC40E0B610918DCC8BE3A195ED;// 0x1ED8(0x00A0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_C8E0AABF492AD26947431CAD9E9B91BF;// 0x1F78(0x0138)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_E20AE2B34463209026A0449C512E112E;// 0x20B0(0x0128)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_4655183648DBB0725D4DF49EB38DF125;// 0x21D8(0x00D8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_6DF6F12D4CBDDC046CB13DA3257797D3;// 0x22B0(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7DA646FD4E9957F8A0178D9074E74EFD;// 0x23D8(0x00D0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_D04A9E22484CAFC197131E9072736B35;// 0x24A8(0x00D8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_0044D2804478C41F80367182FBA57ADE;// 0x2580(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_95B8CE414B48ED0CAC795D833D95602E;// 0x25C0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B062461B4C51399A6DE1AEA4480BF5FD;// 0x2600(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_67BD6BC14271502B6D723DBB14AE3F97;// 0x26A0(0x0128)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9C0129AD47E99FFD7D62A5AA83D0187F;// 0x27C8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F167270C4C04195BB2A6A8B8564292C7;// 0x2868(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_24AACAD94566ADADE7DB618C659A9D13;// 0x2908(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_4429DA1F469C74A590CCC0971C522CCE;// 0x2A30(0x0128)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F38BF7184BA0810AB16D3E851CADA6DF;// 0x2B58(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B94143EF4C4BCB7A26C97D80E41DEBE3;// 0x2BF8(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_5807D35E4035F58C44DC6690587FBE05;// 0x2CC8(0x0128)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_545E364B4182FE044343249DCD0F97DB;// 0x2DF0(0x00D8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_996302AC44A526DF8EE5B3A2C4779496;// 0x2EC8(0x0128)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6643F1DE4B702A6E8675E5862F2C16BF;// 0x2FF0(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D35B966440F2386317331BA2624F654C;// 0x3090(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B13E8E2B4792337601BA82824BA3F2E9;// 0x3160(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7B5DF17641CE5A18551C46B52758E25E;// 0x3200(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2F28329A464885A104EF3A81420EE246;// 0x32D0(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A1902AD54F85BE9AF13AD6BADA5B3693;// 0x3370(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8D78E2F8484FB0F76B05B4B0CDFF1A8B;// 0x3440(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_CB468B64436484A9440C0EBEC151D71E;// 0x34E0(0x00D0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E7E2461E4434CEC30D3694B619D2EC0F;// 0x35B0(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_DABAA2504809372CFA5DCBB9C6A987CA;// 0x36E8(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_00A70DC44891CD65EB98E38855E49577;// 0x3820(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_CD58802645651724C3F3C7AB1749FC01;// 0x3958(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_3FAC085E462C40EC7A9614A196D83FCE;// 0x3A90(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_D80CF66C492232827FA3DF8E993CF087;// 0x3BC8(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_82244DAD410142996B02518D1AD027AD;// 0x3D00(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_3CC7302C4CD11F478F42ADA475EEE495;// 0x3E38(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_2AE72E714B80D6A01F820B9A12EF525C;// 0x3F70(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_3C4DAB7B4E9738CD52FF3A963FA5D900;// 0x40A8(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_C535ACE049571A14329C45906E37DE97;// 0x41E0(0x0138)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_AAD2140E45EF56E95EED878ACA50A6EE;// 0x4318(0x0128)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_39A8AAF2487EB01D495EA6A4B8138E2D;// 0x4440(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_B9E9B29944B54B39FAA423BC15004769;// 0x4480(0x0040)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_9BAE5E8A424CF7F664AA3793EBCF885F;// 0x44C0(0x00D8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_A5446A5E4F4E4F9075D2DFA708908E40;// 0x4598(0x0128)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_32910DEA4868FF462AB38FAF61D9DC55;// 0x46C0(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_3D1BD5D04B40B429D99A19B3C9F16CC8;// 0x4760(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A3D2CBAE4446EA39202B9D83E5BDE1B1;// 0x4830(0x00D0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_7484ECED45BE98E6DCD92EACDBC54A7E;// 0x4900(0x00D8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_71873944487D9648CFC00F993F1A16B3;// 0x49D8(0x0128)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D2E82E79422CA97CE71639AC74FB0A78;// 0x4B00(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A6D756E84352E62D3F1AEC8949DDA0B8;// 0x4BA0(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2883489E4DF9A3039E308CB011BCF567;// 0x4C70(0x0128)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_6B9ACA7C4FE102980B92618BD29C3024;// 0x4D98(0x00D8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_09BA845846B08DC3BE9E64B5461BAE55;// 0x4E70(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_1CA56F27473C6E93B30DDC840CD8FF81;// 0x4F10(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_01B9572C4A0D352936C3E79AC6F2F6D1;// 0x5038(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_10DF9CCB4F334DE00046428229692A0D;// 0x5108(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_4B0072C54418CB70FAD206A780401DE0;// 0x51A8(0x00D8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_BAAA198D4EAB0D6E432B3C80243CC5A5;// 0x5280(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_7B10A1494632ADDFEE6FED9E8A54BD1E;// 0x52C0(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_AF67F32546A931246075D1B75D2839A3;// 0x5300(0x0128)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_C47405B043FC985633B0BAA2301F0CC9;// 0x5428(0x00D8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F14F4F534B27D0B39502E8B3DFEF434A;// 0x5500(0x0128)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A31308EB42F5C775990ACEA97FE541E0;// 0x5628(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_305A43E24257A5321182EF948325AE3E;// 0x56C8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D83D944B4FA6C741FDD2919393869023;// 0x5798(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_32EDB65048D4B15847AAC095AC3B4F95;// 0x5838(0x00D8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_78C86B534DE88D76B91F5F9142498FB1;// 0x5910(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_912056CA4C778C78F472F49E9FB66276;// 0x5950(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2F774D71423F4AB63827D2A24D329749;// 0x5990(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_A28DC2BC4DBAD5C6B1DCE49FF356D7DA;// 0x5AB8(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_925F5B6446F5E315ADB1F29DD4807830;// 0x5BE0(0x0128)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_F9CFCFD348DF0DBAC818B5B22B2A8B16;// 0x5D08(0x00D8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9A3722EF47AAD39665DCC892050CFD16;// 0x5DE0(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_74F9C2F24AFFEC939E1CF8B516B9A81E;// 0x5E80(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_FF739A384EC27746CEAD988046AC96F0;// 0x5FA8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DE0F65A34738CE0BAD696C939089EFB8;// 0x6078(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_FC5B042C45AF86D6C6E5738E31A823FE;// 0x6118(0x00D8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_4478FA6C45909E46E067F7B5D39B97F8;// 0x61F0(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_D9703BDE4607C244B1E97DA6CF67376B;// 0x6230(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_EC103A634655199DCBD7F4B62BAFE72E;// 0x6270(0x0128)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_697D099C4ED9C63A6F2D2EB9BB4369F1;// 0x6398(0x00D8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4BE4A8AA4E0E864C6A6F64926088D7B4;// 0x6470(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_273020F8410E589A614635B088443313;// 0x6510(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4CAD156843F1D9D3B1BA1A8204FC568F;// 0x6638(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C70574484C0FAA617AE114BD6BC95F6E;// 0x6708(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_50DB5B81405F71FDC955D8B841FED152;// 0x67A8(0x00D8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_F9A4C838451ADB9E1FA0E7B8A15C0CC6;// 0x6880(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_AB34AD5249B538B1607C25A5AE23D63B;// 0x68C0(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F67ABBF146CB83E2D031D39BA63E87AB;// 0x6900(0x0128)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_A1721B0C4BC700F0F8B0EF8F05E09FCE;// 0x6A28(0x00D8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_AB0A98EF48D8B124B6E1BD9DC5E40FCB;// 0x6B00(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E08C78A34FB61C27439CD8A038C11D8F;// 0x6C28(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_78ED46FD4FC6AFE1DE65C5A5352F00CB;// 0x6CF8(0x00A0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_007869A24578171574C2C9BB0D7E8C02;// 0x6D98(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_70297C674E83957DEACBB88110D779DC;// 0x6DD8(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_DED7FC204E73A7FB8742F2A590A34675;// 0x6E18(0x0128)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_C24135674643AD40D68326BBF3A170D8;// 0x6F40(0x00D8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_15B41B1D4AD409D2CFF04F89F61B5544;// 0x7018(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7EE47BEE46E05BBB1D7F8197069DF3FB;// 0x70B8(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_098C305E4064322AFECA9690FA3DFFBD;// 0x71E0(0x00D0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_2B9C633745990BB89E4E35AAFB2B7CCA;// 0x72B0(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_70821F0C4941AF92387842BD559FA89E;// 0x72F0(0x0040)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_ACF6304B4D804BB146996DB7242F9227;// 0x7330(0x00D8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_A69EDA514677C62C7EAC84ADF506B114;// 0x7408(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C9CA7AF64AE7C16AA033CCA2D4AEBF18;// 0x7530(0x0128)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_96B3768A4FB858262639388AFB7506A1;// 0x7658(0x00D8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F0F23683460EE8016A8DCE90EC579A58;// 0x7730(0x0128)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_F689F2EB4A7A64848FCB56A74AA826F3;// 0x7858(0x00D8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1382E5EF415D6DCFDFA78E8875ED15AD;// 0x7930(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_BCA2E5334CA5D0283C470CAEBF69B864;// 0x79D0(0x0128)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_42B274DC4D9E15FC6DAF4A9855602F2C;// 0x7AF8(0x00D8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_38CED14E4298A5AE5A7EC0A8349C7F4B;// 0x7BD0(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_97E082B349207CA056B020A897CB7A12;// 0x7C70(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_A0B7CCEC4255EE7CFDCE6AA59142D85D;// 0x7D40(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E2761B0E444C6C756073458286DD3C04;// 0x7E68(0x00D0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_6A0F404E41D7A099568914A5756847AD;// 0x7F38(0x00D8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_8016E5244FAA8B281CE70398F31008F9;// 0x8010(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_1D5C95304D249CC2CB85A880C7D23984;// 0x8050(0x0040)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_B61A84404D83786ECCBCA0B1A20A1F6B;// 0x8090(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B84A40F147352EB2159B1C9945CA9A7D;// 0x8170(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F8C4014E4C4751825449F8AE76AC5B22;// 0x8298(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A7A10CF44F9B4306B41AC1893BC79AAA;// 0x83C0(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A1034E8646514CE4245DC6A8BC11BF03;// 0x8490(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_8825CACF42C2FF3670A78DA0BA03040B;// 0x8530(0x00D8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_7C5B54C449E55478D8F9A8966D84D7DF;// 0x8608(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_CB328F32485F79EA60547F82FD757070;// 0x8648(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F67A312A4BD8904ADC42A2B89F9BFC2D;// 0x8688(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_8839AFDE4BC4C7370838B4B2DBE84FBF;// 0x87B0(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5DC71AFD4E5103DD14DAACB28A288523;// 0x88D8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_993052574158436B922BBFAD04C74A35;// 0x89A8(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_1713C1A5414A9753277EFEABC1F89E24;// 0x8A48(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CD76CD864EE35C49DC09C384B4701415;// 0x8B18(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_C3E0B0724B89B6833DC1B48E2DCCBC45;// 0x8BB8(0x00D8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_C0AB751C407DDF2994ADA9A02B36C4DB;// 0x8C90(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_0BF3A66A4D2404385ADFCB9C5E6BB81D;// 0x8CD0(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_1BE57BC347AD7B7535269F89E2B2A03A;// 0x8D10(0x0128)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2AD4E6BA4009DE1A1227FB8E30442E77;// 0x8E38(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4341CB2B41C8CE71F11FD99992273AEF;// 0x8ED8(0x00D0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_D3C512D64B66B8F7AB92B79ECC95CAF9;// 0x8FA8(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CB24DFE1476DD8F442B44BA8699E029A;// 0x9088(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_0C3B3D8545012BD32C4279A6D9EF3671;// 0x9128(0x00D8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_A5A8AB0C4898B1E8A96865BEBB2553AF;// 0x9200(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_8F9AC31F4FF4E91C8D66E0BD78A3FC31;// 0x9240(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_689193B84F6CFF0EF77188A24230B479;// 0x9280(0x0128)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_B95B570D4F9312E4873629B831816AE2;// 0x93A8(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_24EBAC404BA78F0F89B2D9984A99993A;// 0x93E8(0x00E0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_1A05EF9C4323A36A6F70749099B60F17;      // 0x94C8(0x0068)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_DD570C9A48A722A7D86C859447E22A7B;// 0x9530(0x00D8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_7DEFD20F481DE3839AA90A9948CB5147;// 0x9608(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_593AD5F2425093B67487BA8FC3A7AC3E;// 0x96E0(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B5E0DDCB43532C7143EFA0BB98493199;// 0x9728(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_883BD8E84E3A5DD0F973009C9F00AEC7;// 0x9770(0x00D0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_772118D44AF91968CE4C5E837CAE85B6;// 0x9840(0x00D8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C01DB7D0479D7F3DA23686B4FE75640D;// 0x9918(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_CD15FB8547F87928BC72FCBE264EC0A4;// 0x99B8(0x00D8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_DBA850A445D03212EE356CAC86B53B38;// 0x9A90(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6CE1BBE646046042F96E8B84F823DEEB;// 0x9B68(0x0048)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_D5A6509A4806FF19E0156D90FDCBFCEE;// 0x9BB0(0x00E0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_0A17C1DA4A8B5E81E90E4B9BD22CAFBC;// 0x9C90(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_09BFB35C46B356FB528833AA23F3C239;// 0x9D68(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_5B37A9344247D21F3CAA7C9B756C9942;// 0x9DB0(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_907CAF2441787C4407194683E3BE66E1;// 0x9DF8(0x00D0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_5B9EC6314ED6C699174490ADC375459D;// 0x9EC8(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_25D7F30E439A9A11E243F6B1A97AAFFB;// 0x9FA0(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_2EE077AB4F9A4BC7CA505DB1E8DFB448;      // 0x9FE8(0x0068)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_06E6329D440877503CF21C8F2AE1467D;// 0xA050(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_415D43324334437522FDE98B06DDB920;// 0xA120(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3ECA419E484D1918258784A0290031DD;// 0xA1C0(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_BF0F406E4B8303B312D26288426A2C8B;// 0xA260(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_E5D1696E475643F6F07E528B9F940588;// 0xA2A8(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6B080E1C4B8EE2B40D8611BC4D42C351;// 0xA380(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_88A192ED46B2D17FC8620FB886F528F5;// 0xA3C8(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_9B276367400683E52151E191F3CD2506;// 0xA410(0x00D0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_3D21355E4CA427974861E7B0B6258A99;// 0xA4E0(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C5E373374C7F98C00D661CBD72F421AD;// 0xA528(0x00D0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_D3BC91A24AC3538BBB21ACA5E5B409B9;// 0xA5F8(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_5F9EC77641287D565F90149167230F32;// 0xA6D0(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D7A6A01246BB0A4580CC33B08824BBCE;// 0xA718(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_8D4A90BC466F6C6E3DE924AA10510DE9;// 0xA760(0x00D8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8CDE97C3466618EAA4D152A3A13C845E;// 0xA838(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E0DD9D9C45368C272291899EE13B5129;// 0xA8D8(0x00D0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_179BB1374C83CDCD7D8F329EB7579EDA;// 0xA9A8(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_05468FED43B985D8DA3D58A539F586B5;// 0xA9F0(0x00D0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2768F45C4A12AEAF6668C2AA75E78773;// 0xAAC0(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_905223594A4AA8805B617A986985BBC0;// 0xAB08(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_106165644CE2C91A9C999D8BA2D8B4FE;// 0xAB48(0x0040)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7D2E1E724EEDCD4C5216B2980889E231;// 0xAB88(0x00D0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_BEF54B0D4E594CA9A1E01BA182BFE79E;// 0xAC58(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_4B994116459E8EB1645EE7A89829C5E4;// 0xAD30(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_74DEFCDD4C8888512D97B6AAA9C08898;// 0xAD78(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_CC46D53641477E1712001A9E4C0FB215;// 0xADC0(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_310086B24504AE9DE35CD8AC18F57306;// 0xAEF8(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_A8B5106C4F8CB1D22E04A89230CACA04;// 0xB030(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_52D8EEC847D1D3D75404848EAC38011B;// 0xB168(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_5C0C47104251609F4C2730ABC4938AC2;// 0xB2A0(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_8C597DD447DDD32A887064A7C852B639;// 0xB3D8(0x0138)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_9D28C3AC4C4C8CDB2FE27DA107C6A684;// 0xB510(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_78060B44460D44F05D31149514FDF7D2;// 0xB5E8(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9874BEFC4ADDFFA4D2EA40B528C1F0C6;// 0xB630(0x0048)
	int                                                BlockPose;                                                // 0xB678(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Speed;                                                    // 0xB67C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AmuletSpeed;                                              // 0xB680(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AmuletTimer;                                              // 0xB684(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AmuletTime;                                               // 0xB688(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CurrentSteeringFrame;                                     // 0xB68C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              StomachPitch;                                             // 0xB690(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     LookAtLocation;                                           // 0xB694(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     SteeringWheelLookAtLocation;                              // 0xB6A0(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<E_AnimationType>                       AnimationType;                                            // 0xB6AC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<E_Vehicles>                            VehicleState;                                             // 0xB6AD(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               FPSMode;                                                  // 0xB6AE(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               SteeringRight;                                            // 0xB6AF(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bSteering;                                                // 0xB6B0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bInAir;                                                   // 0xB6B1(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bSprinting;                                               // 0xB6B2(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Obstructed;                                               // 0xB6B3(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               HammerEquiped;                                            // 0xB6B4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Repairing;                                                // 0xB6B5(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               FullPose;                                                 // 0xB6B6(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Blocking;                                                 // 0xB6B7(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               UsingTeleport;                                            // 0xB6B8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               LookingAtWorldMap;                                        // 0xB6B9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               SpyGlassActive;                                           // 0xB6BA(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Aiming;                                                   // 0xB6BB(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               SwitchingWeapons;                                         // 0xB6BC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Swimming;                                                 // 0xB6BD(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               MakeHammerHitSound;                                       // 0xB6BE(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsDead;                                                   // 0xB6BF(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AimingPlayRate;                                           // 0xB6C0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               CanRepair;                                                // 0xB6C4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               OnMovingBase;                                             // 0xB6C5(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               WaterInShip;                                              // 0xB6C6(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass Character_AnimBP.Character_AnimBP_C");
		return ptr;
	}


	void PlayJumpLandSound(class UPhysicalMaterial* PhysicalSurface, const struct FVector& Location);
	void PlayJumpLaunchSound(class UPhysicalMaterial* PhysicalSurface, const struct FVector& Location);
	void PlayFootstepSound(class UPhysicalMaterial* SurfaceType, bool OwnFootsteps_, const struct FVector& WorldLocation);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Character_AnimBP_AnimGraphNode_BlendListByBool_5DC71AFD4E5103DD14DAACB28A288523();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Character_AnimBP_AnimGraphNode_BlendListByBool_A6D756E84352E62D3F1AEC8949DDA0B8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Character_AnimBP_AnimGraphNode_BlendListByBool_3D1BD5D04B40B429D99A19B3C9F16CC8();
